Revit 2024 API
StructuralElementDefinitionData.YOffset Property
 Y offset.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double YOffset { get; }
Visual Basic
Public ReadOnly Property YOffset As Double
	Get
Visual C++
public:
property double YOffset {
	double get ();
}
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace